load-testing/app/scenarios/commonwealth-api-threads.yml
config:
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
      metricsNamespace: "latency_metrics"
  environments:
    us:
      target: "https://us.unique.rocks"
    eu:
      target: "https://eu.unique.rocks"
    local:
      target: "http://localhost:8080"
    beta:
      target: "https://commonwealth-beta.herokuapp.com"
    frick:
      target: "https://commonwealth-frick.herokuapp.com"
    frack:
      target: "https://commonwealth-frack.herokuapp.com"
  http:
    extendedMetrics: true
  phases:
    - name: "Warm up"
      duration: 10
      arrivalRate: 5
scenarios:
  - name: "Read Endpoints"
    flow:
      - get:
          url: "/{{$processEnvironment.TEST_COMMUNITY}}"
      - get:
          name: "/api/activeThreads"
          url: "/api/threads"
          qs:
            chain: "{{$processEnvironment.TEST_COMMUNITY}}"
            active: true
            threads_per_topic: 3
          capture:
            json: "$.result[*].id"
            as: "activeThreadIds"
      - log: "activeThreadIds {{activeThreadIds}}"
      - get:
          name: "/api/selectThread"
          url: "/api/threads"
          qs:
            thread_ids[]: "{{$processEnvironment.TEST_THREAD_ID}}"
            chain: "{{$processEnvironment.TEST_COMMUNITY}}"
          capture:
            json: "$.result[0].id"
            as: "threadId"
      - log: "threadId {{threadId}}" 
      - get:
          name: "/api/bulkThreads"
          url: "/api/threads"
          qs:
            chain: "{{$processEnvironment.TEST_COMMUNITY}}"
            bulk: true
            limit: 20
            page: 0
            includePinnedThreads: true
            to_date: "2023-07-14T00:45:40.993Z"
            orderBy: "createdAt:desc"
          capture:
            json: "$.result.threads[*].id"
            as: "bulkThreadIds"
      - log: "bulkThreadIds {{bulkThreadIds}}" 
      - post:
          url: "/api/reactionsCounts"
          json:
            thread_ids: "{{bulkThreadIds}}"
          capture:
            json: "$.result[*].thread_id"
            as: "reactionsCounts"
      - log: "reactionsCounts {{reactionsCounts}}"
      - post:
          url: "/api/viewUserActivity"
          form:
            jwt: "{{$processEnvironment.JWT}}"
      - post:
          url: "/api/viewGlobalActivity"